{ 
    "articles": [
        {
            "id":3,
            "folder":"/articles/wen-pr19-restoration/",
            "images":[
                {
                    "src":"/img/wen-pr19-outside.jpg",
                    "caption":"After cleaning, lubrication, reassembly and painting, this old belt sander is ready for regular use!"
                },
                {
                    "src":"/img/wen-pr19-inside.jpg",
                    "caption":"The roller mechanism shroud was so full of grime when I first looked in it was hard to tell what was what."
                },
                {
                    "src":"/img/wen-pr19-pre-assembly.jpg",
                    "caption":"The final three components to be assembled after painting and protection of the baseplate."
                }
            ],
            "date":"10-23-2019",
            "title":"Restoring a WEN PR19 Belt Sander",
            "subtitle":"An old belt sander given a fresh coat of paint, and a new life to go along with it.",
            "bodyElements":[
                {
                    "type":"p",
                    "contents":"Let's get the sentimental stuff out of the way..."
                },
                {
                    "type":"p",
                    "contents":"This old belt sander belonged to my grandfather.  There is a special connection to him that I feel while working on (or with) his old tools.  My relationship with him when he was alive wasn't bad, I supposed the best word to describe it would be <q>limited.</q>  He was a kind and soft-spoken man, but I didn't see him much.  The time I did spend with him was usually pass by listening to his stories, which he was full of.  He was a mechanic by trade, working on battleships in WWII, and all manner of machines afterwards."
                },
                {
                    "type":"p",
                    "contents":"After buying my first (and current at time of writing) house, each time I saw my grandfather he would have a plastic tote, old wooden box, or duffle bag full of his old tools.  He wasn't working anymore, and they occupied most of the storage space he had, having amassed them over a lifetime.  We would sit down and go through them all each time.  Most I knew, but some I didn't.  They all had a story.  I could never remember them all, but I am glad to have had the time with him."
                },
                {
                    "type":"embed",
                    "contents":"<iframe class=\"iframe_video\" src=\"https://www.youtube.com/embed/1ivED-AcioU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>"
                },
                {
                    "type":"p",
                    "contents":"Here is a short video detailing the final re-assembly."
                },
                {
                    "type":"p",
                    "contents":"Unfortunately, when I decided to document this I had already completed most of it, so there are no pictures of the tool before.  The now orange shroud was raw metal and growing a lovely white fuzz, the bottom plate that the belt slides on had completely rusted over, and it was full of sawdust and grease beyond all recognition."
                }
            ]
        },
        {
            "id":2,
            "folder":"/articles/my-old-block-plane/",
            "images":[
                {
                    "src":"/img/gp-block-plane-original.jpg",
                    "caption":"My Grandpas well-used block plane."
                },
                {
                    "src":"/img/gp-block-plane-cleaned.jpg",
                    "caption":"Nice and clean!"
                },
                {
                    "src":"/img/gp-block-plane-cleaned-shaving.jpg",
                    "caption":"Of course I have to sharpen the iron and give it a test before I could finish..."
                },
                {
                    "src":"/img/gp-block-plane.jpg",
                    "caption":"Cleaned, painted, sharpened.  Maybe I shouldn't have done all red?"
                }
            ],
            "date":"2019-10-16",
            "title":"Block Plane",
            "subtitle":"Block Plane Subtitle",
            "bodyElements":[
                {
                    "type":"p",
                    "contents":"The is not something that I have a strong grasp on."
                },
                {
                    "type":"p",
                    "contents":"It's not something that I particularly like about myself.  I don't like needing to be reminded of something that <em>I</em> did.  Sure every once in a while it wouldn't be so bad, but it is a constant for me.  I forget life events easily, I forget people easily.  If I were asked about college I could give some highlights, highschool I could give less.  Forget about childhood, bits and pieces at this point."
                }
            ]
        },
        {
            "id":1,
            "folder":"/articles/website-from-scratch/",
            "images":[
                {
                    "src":"/img/early-code-screencap.png",
                    "caption":"The source code only a couple nights into development."
                },
                {
                    "src":"/img/first-article-screen.png",
                    "caption":"Broken images, questionable formatting... Gotta love it!"
                }
            ],
            "date":"2019-10-16",
            "title":"A Website From Scratch...",
            "category":"Development",
            "subtitle":"An origin story",
            "bodyElements":[
                {
                    "type":"p",
                    "contents":"As I type this, I have been working as a software developer for just about seven years now.  I have worked on many successful projects utilizing a variety of technologies.  As far as I know my clients have always been satisfied with the solutions I have delivered.  Despite my successful career, I have always had it in the back of my mind that I have neglected to do something important..."
                },
                {
                    "type":"p",
                    "contents":"I've never built a website!"
                },
                {
                    "type":"p",
                    "contents":"Now, I'm not saying that I have never <strong>worked on</strong> a website before.  I do that almost every day.  What I mean is that I have never sat down with empty folder and created that very first index.html file.  Some part of me has always felt that I <i>had</i> to create something from scratch in this manner.  It hasn't come up in the course of my work, and I don't expect it to, not when sites like Wix and WordPress make it a simple point-and-click affair to get a site up and running."
                },
                {
                    "type":"p",
                    "contents":"So, when I found myself interested in writing a blog, the idea of creating it from scratch bubbled to the surface.  It didn't take hold immediately however..."
                },
                {
                    "type":"p",
                    "contents":"I took a look at WordPress first, created a site on the free tier (I am what you might call <q>frugal</q>, or maybe a cheap SOB.  Take your pick.) and I wasn't all that impressed.  It felt so limiting.  If you can imagine, it was like taking away my motorcycle and replacing it with my toddlers bike, training wheels and all.  I didn't want that, I wanted as much control as possible, <i>without</i> paying for it of course."
                },
                {
                    "type":"p",
                    "contents":"Now, I want to be perfectly clear.  <strong>I am NOT an expert on WordPress.</strong>  I'm barely even acquainted.  You might be saying that I didn't even give WordPress a real chance, and that I couldn't possibly know if it was actually limiting or not, and you'd be right.  I didnt give WordPress a real chance. I  knew as soon as I started looking into it that I simply didn't feel like learning how to do it their way.  What WordPress would have likely saved me is time.  It would have however, robbed me of satisfaction."
                },
                {
                    "type":"img"
                },
                {
                    "type":"p",
                    "contents":"Another revelation that might sound strange to you... this is the first development project that I have ever taken it upon myself to build.  In the past I have found my creative outlets in places far from the skillset of my day job.  Working on and riding my motorcycle, renovating my house, restoring old tools, woodworking, all a far cry from what pays the bills.  The idea of building this website/blog is the first thing that drew me to the computer after hours with a desire to create, and it has been some of the most enjoyable work of this type that I have done."
                },
                {
                    "type":"p",
                    "contents":"So, this is the origin story of this site.  As I write this, my first post, the site isn't even close to what I would consider complete.  The layout is constantly evolving, the color scheme is highly questionable, and most of the links do nothing because I've spent so much time architecting and re-architecting the structure and function of the site that it's all I can do to refine the three pages that currently exist.  If you've made it this far, I'd really like to <strong>thank you for reading!</strong>  I don't know when I'll find the time to write another post between improving the site itself and the rest of my life, but I hope by then it looks better than this..."
                }

            ]
        },
        {
            "id":1,
            "folder":"/articles/first-article-title/",
            "images":[],
            "date":"10-01-2019",
            "title":"First Article Title",
            "subtitle":"For a bit more description, here's a Subtitle",
            "bodyElements":[
                {
                    "type":"p",
                    "contents":"This is the body of an article that I've written.  It has a lot of good information in it and I hope it will help you while you are doing some activity that this article is about."
                }
            ]
        }
]}